#pragma once

#include "stdafx.h"

#include "environment_setting.h"

//------------------------------------------------------------------------------
//		*함수 정의부*
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
//	x 범위 체크
//
//	:출력 화면 설정 너비와 비교
//------------------------------------------------------------------------------
bool CheckRangeX(int x)
{
	if (0 > x || x >= SIZE_PLAY_SCREEN::PLAY_SCREEN_WIDTH)
		return false;
	else
		return true;

}


//------------------------------------------------------------------------------
//	y 범위 체크
//
//	:출력 화면 설정 높이와 비교
//------------------------------------------------------------------------------
bool CheckRangeY(int y)
{
	if (0 > y || y >= SIZE_PLAY_SCREEN::PLAY_SCREEN_HEIGHT)
		return false;
	else
		return true;

}
